C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t MLEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA9 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_MLEN_GPIO, BOARD_INITPINS_MLEN_PIN, &MLEN_config);

    gpio_pin_config_t OLED_SCL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA26 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_OLED_SCL_GPIO, BOARD_INITPINS_OLED_SCL_PIN, &OLED_SCL_config);

    gpio_pin_config_t OLED_SDA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA27 (pin 78)  */
    GPIO_PinInit(BOARD_INITPINS_OLED_SDA_GPIO, BOARD_INITPINS_OLED_SDA_PIN, &OLED_SDA_config);

    gpio_pin_config_t OLED_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA28 (pin 79)  */
    GPIO_PinInit(BOARD_INITPINS_OLED_RST_GPIO, BOARD_INITPINS_OLED_RST_PIN, &OLED_RST_config);

    gpio_pin_config_t OLED_DC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA29 (pin 80)  */
    GPIO_PinInit(BOARD_INITPINS_OLED_DC_GPIO, BOARD_INITPINS_OLED_DC_PIN, &OLED_DC_config);

    gpio_pin_config_t CAMD0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 81)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD0_GPIO, BOARD_INITPINS_CAMD0_PIN, &CAMD0_config);

    gpio_pin_config_t CAMD1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 82)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD1_GPIO, BOARD_INITPINS_CAMD1_PIN, &CAMD1_config);

    gpio_pin_config_t CAMD2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 83)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD2_GPIO, BOARD_INITPINS_CAMD2_PIN, &CAMD2_config);

    gpio_pin_config_t CAMD3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 84)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD3_GPIO, BOARD_INITPINS_CAMD3_PIN, &CAMD3_config);

    gpio_pin_config_t CAMD4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB4 (pin 85)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD4_GPIO, BOARD_INITPINS_CAMD4_PIN, &CAMD4_config);

    gpio_pin_config_t CAMD5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB5 (pin 86)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD5_GPIO, BOARD_INITPINS_CAMD5_PIN, &CAMD5_config);

    gpio_pin_config_t CAMD6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB6 (pin 87)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD6_GPIO, BOARD_INITPINS_CAMD6_PIN, &CAMD6_config);

    gpio_pin_config_t CAMD7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB7 (pin 88)  */
    GPIO_PinInit(BOARD_INITPINS_CAMD7_GPIO, BOARD_INITPINS_CAMD7_PIN, &CAMD7_config);

    gpio_pin_config_t CAMPCLK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB8 (pin 89)  */
    GPIO_PinInit(BOARD_INITPINS_CAMPCLK_GPIO, BOARD_INITPINS_CAMPCLK_PIN, &CAMPCLK_config);

    gpio_pin_config_t CAMSCL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_CAMSCL_GPIO, BOARD_INITPINS_CAMSCL_PIN, &CAMSCL_config);

    gpio_pin_config_t CAMSDA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB10 (pin 91)  */
    GPIO_PinInit(BOARD_INITPINS_CAMSDA_GPIO, BOARD_INITPINS_CAMSDA_PIN, &CAMSDA_config);

    gpio_pin_config_t CAMHREF_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB11 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_CAMHREF_GPIO, BOARD_INITPINS_CAMHREF_PIN, &CAMHREF_config);

    gpio_pin_config_t CAMVSYN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB16 (pin 95)  */
    GPIO_PinInit(BOARD_INITPINS_CAMVSYN_GPIO, BOARD_INITPINS_CAMVSYN_PIN, &CAMVSYN_config);

    gpio_pin_config_t KEY1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB17 (pin 96)  */
    GPIO_PinInit(BOARD_INITPINS_KEY1_GPIO, BOARD_INITPINS_KEY1_PIN, &KEY1_config);

