C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.c
    gpio_pin_config_t KEY2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 97)  */
    GPIO_PinInit(BOARD_INITPINS_KEY2_GPIO, BOARD_INITPINS_KEY2_PIN, &KEY2_config);

    gpio_pin_config_t QESb_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 98)  */
    GPIO_PinInit(BOARD_INITPINS_QESb_GPIO, BOARD_INITPINS_QESb_PIN, &QESb_config);

    gpio_pin_config_t QESa_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB20 (pin 99)  */
    GPIO_PinInit(BOARD_INITPINS_QESa_GPIO, BOARD_INITPINS_QESa_PIN, &QESa_config);

    gpio_pin_config_t QESp_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB21 (pin 100)  */
    GPIO_PinInit(BOARD_INITPINS_QESp_GPIO, BOARD_INITPINS_QESp_PIN, &QESp_config);

    gpio_pin_config_t CCDCLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 110)  */
    GPIO_PinInit(BOARD_INITPINS_CCDCLK_GPIO, BOARD_INITPINS_CCDCLK_PIN, &CCDCLK_config);

    gpio_pin_config_t CCDSI_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 111)  */
    GPIO_PinInit(BOARD_INITPINS_CCDSI_GPIO, BOARD_INITPINS_CCDSI_PIN, &CCDSI_config);

    gpio_pin_config_t SW1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 112)  */
    GPIO_PinInit(BOARD_INITPINS_SW1_GPIO, BOARD_INITPINS_SW1_PIN, &SW1_config);

    gpio_pin_config_t MREN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 120)  */
    GPIO_PinInit(BOARD_INITPINS_MREN_GPIO, BOARD_INITPINS_MREN_PIN, &MREN_config);

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 123)  */
    GPIO_PinInit(BOARD_INITPINS_SW2_GPIO, BOARD_INITPINS_SW2_PIN, &SW2_config);

    gpio_pin_config_t SW3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 124)  */
    GPIO_PinInit(BOARD_INITPINS_SW3_GPIO, BOARD_INITPINS_SW3_PIN, &SW3_config);

    gpio_pin_config_t SW4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin 125)  */
    GPIO_PinInit(BOARD_INITPINS_SW4_GPIO, BOARD_INITPINS_SW4_PIN, &SW4_config);

    gpio_pin_config_t DSPdp_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin 137)  */
    GPIO_PinInit(BOARD_INITPINS_DSPdp_GPIO, BOARD_INITPINS_DSPdp_PIN, &DSPdp_config);

    gpio_pin_config_t DSPa_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin 138)  */
    GPIO_PinInit(BOARD_INITPINS_DSPa_GPIO, BOARD_INITPINS_DSPa_PIN, &DSPa_config);

    gpio_pin_config_t DSPb_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD10 (pin 139)  */
    GPIO_PinInit(BOARD_INITPINS_DSPb_GPIO, BOARD_INITPINS_DSPb_PIN, &DSPb_config);

    gpio_pin_config_t DSPc_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD11 (pin 140)  */
    GPIO_PinInit(BOARD_INITPINS_DSPc_GPIO, BOARD_INITPINS_DSPc_PIN, &DSPc_config);

    gpio_pin_config_t DSPd_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin 141)  */
    GPIO_PinInit(BOARD_INITPINS_DSPd_GPIO, BOARD_INITPINS_DSPd_PIN, &DSPd_config);

    gpio_pin_config_t DSPe_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 142)  */
    GPIO_PinInit(BOARD_INITPINS_DSPe_GPIO, BOARD_INITPINS_DSPe_PIN, &DSPe_config);

    gpio_pin_config_t DSPf_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 143)  */
    GPIO_PinInit(BOARD_INITPINS_DSPf_GPIO, BOARD_INITPINS_DSPf_PIN, &DSPf_config);

    gpio_pin_config_t DSPg_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 144)  */
    GPIO_PinInit(BOARD_INITPINS_DSPg_GPIO, BOARD_INITPINS_DSPg_PIN, &DSPg_config);

    gpio_pin_config_t LED1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE8 (pin 11)  */
    GPIO_PinInit(BOARD_INITPINS_LED1_GPIO, BOARD_INITPINS_LED1_PIN, &LED1_config);

    gpio_pin_config_t LED2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE9 (pin 12)  */
    GPIO_PinInit(BOARD_INITPINS_LED2_GPIO, BOARD_INITPINS_LED2_PIN, &LED2_config);

    gpio_pin_config_t BEEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE12 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_BEEP_GPIO, BOARD_INITPINS_BEEP_PIN, &BEEP_config);

    /* PORTA14 (pin 66) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_DbgUart_TX_PORT, BOARD_INITPINS_DbgUart_TX_PIN, kPORT_MuxAlt3);

    /* PORTA15 (pin 67) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_DbgUart_RX_PORT, BOARD_INITPINS_DbgUart_RX_PIN, kPORT_MuxAlt3);

    /* PORTA26 (pin 77) is configured as PTA26 */
    PORT_SetPinMux(BOARD_INITPINS_OLED_SCL_PORT, BOARD_INITPINS_OLED_SCL_PIN, kPORT_MuxAsGpio);

