C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.c
    /* PORTA27 (pin 78) is configured as PTA27 */
    PORT_SetPinMux(BOARD_INITPINS_OLED_SDA_PORT, BOARD_INITPINS_OLED_SDA_PIN, kPORT_MuxAsGpio);

    /* PORTA28 (pin 79) is configured as PTA28 */
    PORT_SetPinMux(BOARD_INITPINS_OLED_RST_PORT, BOARD_INITPINS_OLED_RST_PIN, kPORT_MuxAsGpio);

    /* PORTA29 (pin 80) is configured as PTA29 */
    PORT_SetPinMux(BOARD_INITPINS_OLED_DC_PORT, BOARD_INITPINS_OLED_DC_PIN, kPORT_MuxAsGpio);

    /* PORTA5 (pin 55) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_ML0_PORT, BOARD_INITPINS_ML0_PIN, kPORT_MuxAlt3);

    /* PORTA6 (pin 58) is configured as FTM0_CH3 */
    PORT_SetPinMux(BOARD_INITPINS_ML1_PORT, BOARD_INITPINS_ML1_PIN, kPORT_MuxAlt3);

    /* PORTA9 (pin 61) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_MLEN_PORT, BOARD_INITPINS_MLEN_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 81) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD0_PORT, BOARD_INITPINS_CAMD0_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 82) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD1_PORT, BOARD_INITPINS_CAMD1_PIN, kPORT_MuxAsGpio);

    /* PORTB10 (pin 91) is configured as PTB10 */
    PORT_SetPinMux(BOARD_INITPINS_CAMSDA_PORT, BOARD_INITPINS_CAMSDA_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[10] = ((PORTB->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTB11 (pin 92) is configured as PTB11 */
    PORT_SetPinMux(BOARD_INITPINS_CAMHREF_PORT, BOARD_INITPINS_CAMHREF_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB11 (pin 92): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_CAMHREF_PORT, BOARD_INITPINS_CAMHREF_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[11] = ((PORTB->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullDown)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTB16 (pin 95) is configured as PTB16 */
    PORT_SetPinMux(BOARD_INITPINS_CAMVSYN_PORT, BOARD_INITPINS_CAMVSYN_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB16 (pin 95): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_CAMVSYN_PORT, BOARD_INITPINS_CAMVSYN_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[16] = ((PORTB->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTB17 (pin 96) is configured as PTB17 */
    PORT_SetPinMux(BOARD_INITPINS_KEY1_PORT, BOARD_INITPINS_KEY1_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[17] = ((PORTB->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB18 (pin 97) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITPINS_KEY2_PORT, BOARD_INITPINS_KEY2_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[18] = ((PORTB->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB19 (pin 98) is configured as PTB19 */
    PORT_SetPinMux(BOARD_INITPINS_QESb_PORT, BOARD_INITPINS_QESb_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[19] = ((PORTB->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB2 (pin 83) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD2_PORT, BOARD_INITPINS_CAMD2_PIN, kPORT_MuxAsGpio);

    /* PORTB20 (pin 99) is configured as PTB20 */
    PORT_SetPinMux(BOARD_INITPINS_QESa_PORT, BOARD_INITPINS_QESa_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB20 (pin 99): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_QESa_PORT, BOARD_INITPINS_QESa_PIN, kPORT_InterruptRisingEdge);

    PORTB->PCR[20] = ((PORTB->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB21 (pin 100) is configured as PTB21 */
    PORT_SetPinMux(BOARD_INITPINS_QESp_PORT, BOARD_INITPINS_QESp_PIN, kPORT_MuxAsGpio);

