C-ZiHao/SJTU-Automation/EI229_工科创ⅣD/Code/board/pin_mux.c
    PORTB->PCR[21] = ((PORTB->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB3 (pin 84) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD3_PORT, BOARD_INITPINS_CAMD3_PIN, kPORT_MuxAsGpio);

    /* PORTB4 (pin 85) is configured as PTB4 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD4_PORT, BOARD_INITPINS_CAMD4_PIN, kPORT_MuxAsGpio);

    /* PORTB5 (pin 86) is configured as PTB5 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD5_PORT, BOARD_INITPINS_CAMD5_PIN, kPORT_MuxAsGpio);

    /* PORTB6 (pin 87) is configured as PTB6 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD6_PORT, BOARD_INITPINS_CAMD6_PIN, kPORT_MuxAsGpio);

    /* PORTB7 (pin 88) is configured as PTB7 */
    PORT_SetPinMux(BOARD_INITPINS_CAMD7_PORT, BOARD_INITPINS_CAMD7_PIN, kPORT_MuxAsGpio);

    /* PORTB8 (pin 89) is configured as PTB8 */
    PORT_SetPinMux(BOARD_INITPINS_CAMPCLK_PORT, BOARD_INITPINS_CAMPCLK_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB8 (pin 89): DMA request on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_CAMPCLK_PORT, BOARD_INITPINS_CAMPCLK_PIN, kPORT_DMARisingEdge);

    PORTB->PCR[8] = ((PORTB->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTB9 (pin 90) is configured as PTB9 */
    PORT_SetPinMux(BOARD_INITPINS_CAMSCL_PORT, BOARD_INITPINS_CAMSCL_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC0 (pin 103) is configured as ADC0_SE14 */
    PORT_SetPinMux(BOARD_INITPINS_CCDAO_PORT, BOARD_INITPINS_CCDAO_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC15 (pin 120) is configured as PTC15 */
    PORT_SetPinMux(BOARD_INITPINS_MREN_PORT, BOARD_INITPINS_MREN_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 123) is configured as PTC16 */
    PORT_SetPinMux(BOARD_INITPINS_SW2_PORT, BOARD_INITPINS_SW2_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[16] = ((PORTC->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC17 (pin 124) is configured as PTC17 */
    PORT_SetPinMux(BOARD_INITPINS_SW3_PORT, BOARD_INITPINS_SW3_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[17] = ((PORTC->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC18 (pin 125) is configured as PTC18 */
    PORT_SetPinMux(BOARD_INITPINS_SW4_PORT, BOARD_INITPINS_SW4_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[18] = ((PORTC->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC5 (pin 110) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_CCDCLK_PORT, BOARD_INITPINS_CCDCLK_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(BOARD_INITPINS_CCDSI_PORT, BOARD_INITPINS_CCDSI_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 112) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_SW1_PORT, BOARD_INITPINS_SW1_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[7] = ((PORTC->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTD0 (pin 127) is configured as FTM3_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_SERVO1_PORT, BOARD_INITPINS_SERVO1_PIN, kPORT_MuxAlt4);

    /* PORTD1 (pin 128) is configured as FTM3_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_SERVO2_PORT, BOARD_INITPINS_SERVO2_PIN, kPORT_MuxAlt4);

    /* PORTD10 (pin 139) is configured as PTD10 */
    PORT_SetPinMux(BOARD_INITPINS_DSPb_PORT, BOARD_INITPINS_DSPb_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[10] = ((PORTD->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTD11 (pin 140) is configured as PTD11 */
    PORT_SetPinMux(BOARD_INITPINS_DSPc_PORT, BOARD_INITPINS_DSPc_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[11] = ((PORTD->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTD12 (pin 141) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_DSPd_PORT, BOARD_INITPINS_DSPd_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[12] = ((PORTD->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTD13 (pin 142) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_DSPe_PORT, BOARD_INITPINS_DSPe_PIN, kPORT_MuxAsGpio);

